CommunityGD32Cores/gigadevice-firmware-and-docs/GD32L23x/GD32L23x_Firmware_Library_V1.0.1/Examples/USBD/audio_headphone/src/gd32l23x_audio_codec.c
/*!
    \file    gd32l23x_audio_codec.c
    \brief   the low layer driver for audio codec

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32l23x_audio_codec.h"
#include "gd32l23x_spi.h"

/* mask for the bit en of the i2s cfgr register */
#define I2S_ENABLE_MASK                    (0x0400U)

/* delay for the codec to be correctly reset */
#define CODEC_RESET_DELAY                  (0x4FFFU)

/* codec audio standards */
#ifdef I2S_STANDARD_PHILLIPS
#define CODEC_STANDARD                 0x04U
#define I2S_STANDARD                   I2S_STD_PHILLIPS
#elif defined(I2S_STANDARD_MSB)
#define CODEC_STANDARD                 0x00U
#define I2S_STANDARD                   I2S_STD_MSB
#elif defined(I2S_STANDARD_LSB)
#define CODEC_STANDARD                 0x08U
#define I2S_STANDARD                   I2S_STD_LSB
#else
#error "Error: No audio communication standard selected !"
#endif /* I2S_STANDARD */

/* the 7 bits codec address (sent through i2c interface) */
#define CODEC_ADDRESS                      0x94U  /* b00100111 */

/* this structure is declared global because it is handled by two different functions */
static dma_parameter_struct dma_initstructure;
static uint8_t output_dev = 0U;

uint32_t audio_totalsize = 0xFFFFU; /* the total size of the audio file */
uint32_t audio_remsize   = 0xFFFFU; /* the remaining data in audio file */
uint16_t *current_pos;             /* the current position of audio pointer */
uint32_t i2s_audiofreq = 0U;

__IO uint32_t  codec_timeout = CODEC_LONG_TIMEOUT;

/* low layer codec functions */
static void     codec_ctrl_interface_init(void);
static void     codec_ctrl_interface_deinit(void);
static void     codec_audio_interface_init(uint32_t audio_freq);
static void     codec_audio_interface_deinit(void);
static void     codec_reset(void);
static uint32_t codec_write_register(uint32_t register_addr, uint32_t register_value);
static void     codec_gpio_init(void);
static void     codec_gpio_deinit(void);

static void     delay(__IO uint32_t ncount);

#ifdef VERIFY_WRITTENDATA
static uint32_t codec_read_register(uint32_t register_addr);
#endif /* VERIFY_WRITTENDATA */

/*!
    \brief      configure the audio peripherals
    \param[in]  output_device: audio output device
      \arg        OUTPUT_DEVICE_SPEAKER
      \arg        OUTPUT_DEVICE_HEADPHONE
      \arg        OUTPUT_DEVICE_BOTH
      \arg        OUTPUT_DEVICE_AUTO
    \param[in]  volume: initial volume level (from 0 (mute) to 100 (max))
    \param[in]  audio_freq: Audio frequency used to play the audio stream
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_init(uint16_t output_device, uint8_t volume, uint32_t audio_freq)
{
    /* perform low layer codec initialization */
    if(0U != codec_init(output_device, VOLUME_CONVERT(volume), audio_freq)) {
        return 1U;
    } else {
        /* i2s data transfer preparation:
           prepare the media to be used for the audio transfer from memory to i2s peripheral */
        audio_mal_init();

        /* return 0 when all operations are OK */
        return 0U;
    }
}

/*!
    \brief      de-initializes all the resources used by the codec (those initialized
                by eval_audio_init() function) EXCEPT the I2C resources since they are
                used by the IOExpander as well (and eventually other modules)
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_deinit(void)
{
    /* DeInitialize the Media layer */
    audio_mal_deinit();

    /* DeInitialize Codec */
    codec_deinit();

    return 0;
}

/*!
    \brief      starts playing audio stream from a data buffer for a determined size
    \param[in]  pbuffer: pointer to the buffer
    \param[in]  size: number of audio data bytes
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_play(uint16_t *pbuffer, uint32_t size)
{
    /* set the total number of data to be played (count in half-word) */
    audio_totalsize = size / 2U;

    /* call the audio codec play function */
    codec_play();

    /* update the media layer and enable it for play */
    audio_mal_play((uint32_t)pbuffer, (uint32_t)(DMA_MAX(audio_totalsize / 2U)));

    /* update the remaining number of data to be played */
    audio_remsize = (size / 2U) - DMA_MAX(audio_totalsize);

    /* update the current audio pointer position */
    current_pos = pbuffer + DMA_MAX(audio_totalsize);

